month = { "1" => 31,
          "2" => 28,
          "3" => 31,
          "4" => 30,
          "5" => 31,
          "6" => 30,
          "7" => 31,
          "8" => 31,
          "9" => 30,
          "10" => 31,
          "11" => 30,
          "12" => 31
}
puts "Введите год: "
y = gets.chomp.to_i
puts "Введите месяц (от 1 до 12): "
m = gets.chomp.to_i
puts "Введите число (от 1 до 31): "
d = gets.chomp.to_i
m = m - 1
s = 0
i = 0
while i <= m do
  s += month[i.to_s].to_i
  i = i + 1
end
if m > 2 && (y%400 == 0 || (y%4 == 0 && y%100 != 0)) 
  puts "Порядковый номер даты: #{s + d + 1}" 
else
  puts "Порядковый номер даты: #{s + d}" 
end
